[
   {
      "id": "0",
      "src": "assets/th-filt.PNG",
      "caption": "Dock Selector",
      "url": "proj/ktg/filter/index.html",
      "desc": "A vanilla JavaScript mock-up that allows you to search for a computer (by brand, model, series etc.) and recommend a dock for it. It will also provide other recommendations.  You can search using the search field or the pull-down menus. Input fields have a blue border and as the user selects an option, the subsequent pull-down menu becomes enabled with the blue border.",
      "arsenal": "HTML5, CSS3, JavaScript",
      "year": "2018",
      "comp": "Kensington",
      "type": "Mock"
   },
   {
      "id": "1",
      "src": "assets/th-d2x.PNG",
      "caption": "Spec-Sheet 2 Excel",
      "url": "proj/ktg/d2x/index.html",
      "desc": "A convenient way for Managers to enter spec-sheet information about a product, and converting it to an excel file (then sent off for translation). The excel file is generated with ENGLISH as the header in the 1st cell, and all the user copy is placed in the 1st column. Adding a new line in the textarea puts that bit of data in a new cell.",
      "arsenal": "HTML5, CSS3, JavaScript, PHP",
      "year": "2018",
      "comp": "Kensington",
      "type": "Mock"
   },
   {
      "id": "2",
      "src": "assets/th-pp.PNG",
      "caption": "Project Planner",
      "url": "proj/ktg/ng1/index.html",
      "desc": "A prototype developed with AngularJS. It demonstrates the approval process between teams during the development cycle. A team further along in the process will not receive visibility or notifications on their dashboard until the product has been approved by the prior team.",
      "arsenal": "AngularJS",
      "year": "2016",
      "comp": "Kensington",
      "type": "Mock"
   },
   {
      "id": "3",
      "src": "assets/th-bganim.PNG",
      "caption": "Animated Background",
      "url": "proj/ktg/bganim/index.html",
      "desc": "This was the initial test for an animated background with text overlay. It was done purely with HTML5 and CSS3. The shapes fade in and out at random sizes and locations.",
      "arsenal": "HTML5, CSS3, JavaScript",
      "year": "2017",
      "comp": "Kensington",
      "type": "Mock"
   },
   {
      "id": "4",
      "src": "assets/th-bsmd.PNG",
      "caption": "Site Revamp",
      "url": "proj/ktg/bsmd/index.html",
      "desc": "This mock-up explored the new Kensington look with Bootstrap and Material Design. The images were dynamically created from www.lorempixel.com. The home, category, sub-category and product detail pages were demonstrated.",
      "arsenal": "HTML5, CSS3, Bootstrap 3, Material Design for Bootstrap, JavaScript",
      "year": "2017",
      "comp": "Kensington",
      "type": "Mock"
   },
   {
      "id": "5",
      "src": "assets/th-wiref.PNG",
      "caption": "Wireframe to HTML5",
      "url": "https://www.kensington.com/us/us/4480/security",
      "desc": "The page design was created by an Ad Agency which I converted to HTML5. To make it visually interesting (creative license), I developed the effects for the QUOTES widget (above the Security Resources section) and the LOGOS widget (below the Security Resources section).",
      "arsenal": "HTML5, CSS3, JavaScript",
      "year": "2017",
      "comp": "Kensington",
      "type": "Mock"
   },
   {
      "id": "6",
      "src": "assets/th-ktgem1.PNG",
      "caption": "Security Email (UK)",
      "url": "proj/ktg/ktgem1/index.html",
      "desc": "The interesting thing about this design was that the numbers and color blocks were pure CSS. The layout was dramatically different on a mobile device than on a desktop. The email was also designed to work in Microsoft Outlook.",
      "arsenal": "HTML5, CSS3",
      "year": "2015",
      "comp": "Kensington",
      "type": "Responsive Email"
   },
   {
      "id": "7",
      "src": "assets/th-ktgem2.PNG",
      "caption": "Security Email (FR)",
      "url": "proj/ktg/ktgem2/index.html",
      "desc": "A security email (French version) that showcased special offers on Lock products. The email was also designed to work in Microsoft Outlook.",
      "arsenal": "HTML5, CSS3",
      "year": "2015",
      "comp": "Kensington",
      "type": "Responsive Email"
   },
   {
      "id": "8",
      "src": "assets/th-ktpem1.PNG",
      "caption": "Newsletter (US)",
      "url": "proj/ktg/ktpem1/index.html",
      "desc": "A newsletter that was sent out to partners whenever a training module was published on the microsite. The designs were converted from Photoshop files provided by an Ad Agency.",
      "arsenal": "HTML5, CSS3",
      "year": "2015",
      "comp": "Kensington",
      "type": "Responsive Email"
   },
   {
      "id": "9",
      "src": "assets/th-blog.PNG",
      "caption": "WordPress Blog",
      "url": "http://blog.kensington.com",
      "desc": "My main responsibility is to maintain, add or create new templates or features and ensure the site looks presentable across devices (e.g. the blog icon should show on iOS devices etc.).",
      "arsenal": "HTML5, CSS3, PHP",
      "year": "2016",
      "comp": "Kensington",
      "type": "WordPress Blog"
   },
   {
      "src": "assets/th-shopsi.PNG",
      "id": "10",
      "caption": "Shopsi",
      "url": "https://play.google.com/store/apps/details?id=com.ikodit.shopsi&hl=en",
      "desc": "This is a simple shopping list for Android devices. You set the minimum quantity threshold (items equal to or below that quantity will be marked red). When items are below the threshold, a list icon appears which - when clicked - shows just the items that are low in quantity; good for those impulsive trips to the grocery store. This app is in the Google Play store.",
      "arsenal": "HTML5, CSS3, JavaScript, Apache Cordova",
      "year": "2015",
      "comp": "N/A",
      "type": "Android App"
   },
   {
      "id": "11",
      "src": "assets/th-adelli.PNG",
      "caption": "Adelli",
      "url": "https://play.google.com/store/apps/details?id=com.ikodit.adelli&hl=en",
      "desc": "A bucket list for Android devices. Users can create an item and add a picture from their device's photo gallery to to that item. When an item has been completed it is dimmed out and moved outside of the list. This app is in the Google Play store",
      "arsenal": "Ionic, AngularJS, Sass",
      "year": "2015",
      "comp": "N/A",
      "type": "Android App"
   },
   {
      "id": "12",
      "src": "assets/th-wordoot.PNG",
      "caption": "Wordoot",
      "url": "https://play.google.com/store/apps/details?id=com.ikodit.wordoot&hl=en",
      "desc": "A game for Android devices. It challenges the user to find words hidden among the tiles of letters. It captures both the player's current and best times. The words may be arranged up, down, left, right, diagonal and in reverse order. This app is in the Google Play store.",
      "arsenal": "HTML5, CSS3, Bootstrap 2, JavaScript",
      "year": "2015",
      "comp": "N/A",
      "type": "Android App"
   },
   {
      "id": "13",
      "src": "assets/th-gam.PNG",
      "caption": "Clue",
      "url": "http://www.ikodit.com/proj/ktg/gam/index.html",
      "desc": "A proof of concept which leveraged the animation capabilities of EaselJS. A clue word is given at the bottom of the screen. The user clicks a falling object (in this case a country flag) that is related to the clue. SoundJS was used to check the browser's compatibility with the audio file types, and PreloadJS was utilized to ensure all assets were ready before gameplay.",
      "arsenal": "HTML5, CSS3, EaselJS, SoundJS, PreloadJS",
      "year": "2015",
      "comp": "Kensington",
      "type": "Proof of Concept"
   },
   {
      "id": "14",
      "src": "assets/th-tileanim.PNG",
      "caption": "Animated Tiles",
      "url": "http://www.ikodit.com/proj/ktg/tileanim/index.html",
      "desc": "This was a prototype for a section of a landing page that would have animated logos. A tile was chosen randomly, the animation would be applied and when completed, another tile was randomly chosen in a continuous loop.",
      "arsenal": "HTML5, CSS3, JavaScript",
      "year": "2017",
      "comp": "Kensington",
      "type": "Mock"
   },
   {
      "id": "15",
      "src": "assets/th-scl.PNG",
      "caption": "Scrolling Blur FX",
      "url": "http://www.ikodit.com/proj/ktg/scl/index.html",
      "desc": "This prototype demonstrated how to accomplish the blurring/sharpening of an element by scrolling. As the picture is scrolled upwards it becomes more focused. At the midway point of the browser's height it remains sharp.",
      "arsenal": "HTML5, CSS3, JavaScript",
      "year": "2017",
      "comp": "Kensington",
      "type": "Mock"
   },
   {
      "id": "16",
      "src": "assets/th-calendar.PNG",
      "caption": "Banner Calendar",
      "url": "proj/ktg/bannercal/bnrv2.html",
      "desc": "A calendar for regions to see the banners scheduled for their home page. ",
      "arsenal": "HTML5, CSS3, jQuery",
      "year": "2012",
      "comp": "Kensington",
      "type": "Mock"
   },
   {
      "id": "17",
      "src": "assets/th-eml.PNG",
      "caption": "Email Template Selector",
      "url": "proj/ktg/eml/index.html",
      "desc": "The Email Picker was created to help regions choose an email design, fill out information and submit it to the email team. PHP was used to handle the CORS (cross origin resource sharing), get the request and send the formatted email to the team.",
      "arsenal": "HTML5, CSS3, jQuery, PHP",
      "year": "2012",
      "comp": "Kensington",
      "type": "Mock"
   },
   {
      "id": "18",
      "src": "assets/th-ba.PNG",
      "caption": "Buyer Appreciation",
      "url": "proj/ven/ba07/index.html",
      "desc": "The Buyers Apprection Widget allowed an eBay seller to display a list of their top buyers. The information was received in XML format. The challenge was to make the widget fit in an area with very little clearance for height, so scrolling the names was the solution. Adobe Flash required.",
      "arsenal": "ActionScript",
      "year": "2007",
      "comp": "Vendio",
      "type": "SWF"
   },
   {
      "id": "19",
      "src": "assets/th-dsk.PNG",
      "caption": "Desktop Tutorial",
      "url": "proj/ven/dsk07/index.html",
      "desc": "This was the desktop tutorial of the Sales Management Software. Video was captured with Camtasia, and audio (not included) was added later. You can click the CHAPTER button to navigate. Adobe Flash required.",
      "arsenal": "ActionScript",
      "year": "2007",
      "comp": "Vendio",
      "type": "SWF"
   },
   {
      "id": "20",
      "src": "assets/th-dtb.PNG",
      "caption": "Skinnable Toolbar",
      "url": "proj/ven/dtb08/index.html",
      "desc": "With this toolbar, customers could customize the look of the toolbar as well as change their language from their dashboard. Users who used the toolbar would then see the changes.",
      "arsenal": "HTML, CSS, JavaScript",
      "year": "2008",
      "comp": "Vendio",
      "type": "Mock"
   },
   {
      "id": "21",
      "src": "assets/th-dwl.PNG",
      "caption": "Carousel of Deals",
      "url": "proj/ven/dwl08/index.html",
      "desc": "This widget imported a user's wishlist from ecommerce websites. It could be shared with others. The widget also had a few themes such as Winter and Valentines. Note: The widget here is not fully functional. Adobe Flash Player required.",
      "arsenal": "ActionScript",
      "year": "2008",
      "comp": "Vendio",
      "type": "SWF"
   },
   {
      "id": "22",
      "src": "assets/th-mdb.PNG",
      "caption": "Desktop Notifier",
      "url": "proj/ven/mdb08/index.html",
      "desc": "The application was the desktop version of the Deals widget. It was designed to be at the bottom of the user's desktop and, as deals were found on the web, expanded to show the deal. The prototype shows different states of the widget: 1 alert, 2 or more alerts, notifications, and the arrows which  collapse/expand the view.",
      "arsenal": "HTML, CSS, JavaScript",
      "year": "2008",
      "comp": "Vendio",
      "type": "Prototype"
   },
   {
      "id": "23",
      "src": "assets/th-mk1.PNG",
      "caption": "Animated Banner",
      "url": "proj/ven/mk107/index.html",
      "desc": "This was a typical flash banner showcasing a customer's product. The widget was part of the strategy to promote customer recognition and repeated visits.",
      "arsenal": "ActionScript",
      "year": "2007",
      "comp": "Vendio",
      "type": "SWF"
   },
   {
      "id": "24",
      "src": "assets/th-mk2.PNG",
      "caption": "Top Seller Banner",
      "url": "proj/ven/mk207/index.html",
      "desc": "This was a typical flash banner showcasing a customer's product. The widget was part of the strategy to promote customer recognition and repeated visits.",
      "arsenal": "ActionScript",
      "year": "2007",
      "comp": "Vendio",
      "type": "SWF"
   },
   {
      "id": "25",
      "src": "assets/th-graph.PNG",
      "caption": "Creative Capacity Graph",
      "url": "proj/ora/graph/index.html",
      "desc": "Developed for the Creative team, the weekly chart showed the number, type, and \"exceeded by\" amount of requests. For the data to be entered and stored on the server, a dashboard (PHP) was also created for Project Managers to enter the value in each week. PHP was used to write the file on the server.",
      "arsenal": "HTML, JavaScript, ActionScript, PHP",
      "year": "2004",
      "comp": "Oracle",
      "type": "SWF"
   },
   {
      "id": "26",
      "src": "assets/th-oat.PNG",
      "caption": "Online Approvals",
      "url": "proj/ora/oat/index.php",
      "desc": "The Online Approval Tool was a Flash interface which allowed Project Managers to select team members for a project with following roles: the Requestor (usually from the Marketing Dept.), Graphic Designer, Project Manager and Art Director. When the project was created, the team received an email (PHP) with a link to this tool. If a designer added a comment, the team would be notified. To avoid excessive emails, team members could choose who should receive their comment before sending it. The notification included a link to the tool as well as the Creative Asset. When a member approved the assets, a checkmark with the date and time was placed next to their name. When all members had a checkmark, the project was closed. Users could search for past (closed) projects. Closed projects were read-only. The tool became quite popular (beyond the intended scope of department) and was evenutally converted into the ORACLE IT environment.",
      "arsenal": "HTML, JavaScript, ActionScript, PHP",
      "year": "2005",
      "comp": "Oracle",
      "type": "SWF"
   },
   {
      "id": "27",
      "src": "assets/th-portal.PNG",
      "caption": "9iAS Portal Banner",
      "url": "proj/ora/portal/index.html",
      "desc": "This was a skyscraper banner which used ClickTag. The challenge of this banner was to keep it under 10kb, yet show the different features of 9iAS. I created a stub, and had the interactive movies loaded in when clicked.",
      "arsenal": "HTML, JavaScript, ActionScript",
      "year": "2003",
      "comp": "Oracle",
      "type": "SWF"
   }
]